Repository: randprotocol/clients
Catalog: ios/RandWallet/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fa, fr, hi, id, it, ja, ko, ms, pl, ps, pt_br, ru, ta, ur, zh_hans, zh_hant_hk

# prover key is %@ bytes, expected %@
source: prover key is %1$@ bytes, expected %2$@
ar: مفتاح المُثبِت %@ بايت، والمتوقع %@
de: der Prover-Schlüssel hat %@ Bytes, erwartet %@
es: la clave del probador tiene %@ bytes, se esperaban %@
fa: کلید اثبات‌گر %@ بایت است، انتظار می‌رفت %@
fr: la clé du prouveur fait %@ octets, %@ attendus
hi: प्रूवर की %@ बाइट की है, अपेक्षित %@
id: kunci prover berukuran %@ byte, seharusnya %@
it: la chiave del prover è di %@ byte, attesi %@
ja: プルーバーの鍵は %@ バイトですが、%@ バイトが必要です
ko: 프루버 키가 %@바이트입니다. %@바이트여야 합니다
ms: kunci pembukti ialah %@ bait, dijangka %@
pl: rozmiar klucza provera: %@ B, oczekiwano %@ B
ps: د ثبوت جوړوونکي کیلي %@ بایټه ده، %@ تمه کېده
pt_br: a chave do provador tem %@ bytes, esperado %@
ru: ключ прувера занимает %@ Б, ожидается %@
ta: நிரூபிப்பான் விசை %@ பைட்டுகள், எதிர்பார்க்கப்பட்டது %@
ur: پروور کی کی %@ بائٹس کی ہے، %@ متوقع تھے
zh_hans: 证明器密钥为 %@ 字节，应为 %@
zh_hant_hk: 證明器密鑰有 %@ 位元組，應為 %@

source: prover key is not base58: %@
ar: مفتاح المُثبِت ليس بترميز base58: %@
de: der Prover-Schlüssel ist kein Base58: %@
es: la clave del probador no es base58: %@
fa: کلید اثبات‌گر base58 نیست: %@
fr: la clé du prouveur n'est pas en base58 : %@
hi: प्रूवर की base58 नहीं है: %@
id: kunci prover bukan base58: %@
it: la chiave del prover non è base58: %@
ja: プルーバーの鍵が base58 ではありません: %@
ko: 프루버 키가 base58이 아닙니다: %@
ms: kunci pembukti bukan base58: %@
pl: klucz provera nie jest w base58: %@
ps: د ثبوت جوړوونکي کیلي base58 نه ده: %@
pt_br: a chave do provador não é base58: %@
ru: ключ прувера не в base58: %@
ta: நிரூபிப்பான் விசை base58 அல்ல: %@
ur: پروور کی کی base58 نہیں ہے: %@
zh_hans: 证明器密钥不是 base58：%@
zh_hant_hk: 證明器密鑰不是 base58：%@

source: proving failed: %@
ar: فشل الإثبات: %@
de: Beweis fehlgeschlagen: %@
es: la prueba falló: %@
fa: اثبات ناموفق بود: %@
fr: échec de la preuve : %@
hi: प्रूफ़ बनाना विफल रहा: %@
id: pembuktian gagal: %@
it: generazione della prova non riuscita: %@
ja: 証明に失敗しました: %@
ko: 증명 실패: %@
ms: pembuktian gagal: %@
pl: generowanie dowodu nie powiodło się: %@
ps: ثبوت جوړول ناکام شو: %@
pt_br: a prova falhou: %@
ru: построить доказательство не удалось: %@
ta: நிரூபித்தல் தோல்வியடைந்தது: %@
ur: پروف بنانا ناکام ہو گیا: %@
zh_hans: 证明失败：%@
zh_hant_hk: 生成證明失敗：%@

source: proving the call failed: %@
ar: فشل إثبات الاستدعاء: %@
de: Beweis des Aufrufs fehlgeschlagen: %@
es: falló la prueba de la llamada: %@
fa: اثبات فراخوانی ناموفق بود: %@
fr: échec de la preuve de l'appel : %@
hi: कॉल का प्रूफ़ बनाना विफल रहा: %@
id: pembuktian panggilan gagal: %@
it: la prova della chiamata non è riuscita: %@
ja: 呼び出しの証明に失敗しました: %@
ko: 호출 증명 실패: %@
ms: pembuktian panggilan gagal: %@
pl: generowanie dowodu wywołania nie powiodło się: %@
ps: د غوښتنې ثبوت جوړول ناکام شو: %@
pt_br: a prova da chamada falhou: %@
ru: не удалось доказать вызов: %@
ta: call-ஐ நிரூபிப்பது தோல்வியடைந்தது: %@
ur: کال کا پروف بنانا ناکام ہو گیا: %@
zh_hans: 证明调用失败：%@
zh_hant_hk: 為呼叫生成證明失敗：%@

source: proving the spend authorisation failed: %@
ar: فشل إثبات تفويض الإنفاق: %@
de: Beweis der Ausgabe-Autorisierung fehlgeschlagen: %@
es: falló la prueba de la autorización de gasto: %@
fa: اثبات مجوز خرج ناموفق بود: %@
fr: échec de la preuve de l'autorisation de dépense : %@
hi: खर्च के अधिकार का प्रूफ़ बनाना विफल रहा: %@
id: pembuktian otorisasi pembelanjaan gagal: %@
it: la prova dell'autorizzazione di spesa non è riuscita: %@
ja: 支出承認の証明に失敗しました: %@
ko: 지출 승인 증명 실패: %@
ms: pembuktian kebenaran perbelanjaan gagal: %@
pl: generowanie dowodu autoryzacji wydatku nie powiodło się: %@
ps: د لګښت د اجازې ثبوت جوړول ناکام شو: %@
pt_br: a prova da autorização de gasto falhou: %@
ru: не удалось доказать авторизацию траты: %@
ta: செலவு அங்கீகாரத்தை நிரூபிப்பது தோல்வியடைந்தது: %@
ur: خرچ کی اجازت کا پروف بنانا ناکام ہو گیا: %@
zh_hans: 证明花费授权失败：%@
zh_hant_hk: 為花費授權生成證明失敗：%@

source: rand1… or randpay: link
ar: rand1… أو رابط randpay:
de: rand1… oder randpay:-Link
es: rand1… o enlace randpay:
fa: rand1… یا لینک randpay:
fr: rand1… ou lien randpay:
hi: rand1… या randpay: लिंक
id: rand1… atau tautan randpay:
it: rand1… o link randpay:
ja: rand1… または randpay: リンク
ko: rand1… 또는 randpay: 링크
ms: rand1… atau pautan randpay:
pl: rand1… lub link randpay:
ps: rand1… یا randpay: لینک
pt_br: rand1… ou link randpay:
ru: rand1… или ссылка randpay:
ta: rand1… அல்லது randpay: இணைப்பு
ur: rand1… یا randpay: لنک
zh_hans: rand1… 或 randpay: 链接
zh_hant_hk: rand1… 或 randpay: 連結

source: rand1…, randpay: link or contact
ar: rand1… أو رابط randpay: أو جهة اتصال
de: rand1…, randpay:-Link oder Kontakt
es: rand1…, enlace randpay: o contacto
fa: rand1…، لینک randpay: یا مخاطب
fr: rand1…, lien randpay: ou contact
hi: rand1…, randpay: लिंक या संपर्क
id: rand1…, tautan randpay:, atau kontak
it: rand1…, link randpay: o contatto
ja: rand1…、randpay: リンク、または連絡先
ko: rand1…, randpay: 링크 또는 연락처
ms: rand1…, pautan randpay: atau kenalan
pl: rand1…, link randpay: lub kontakt
ps: rand1…، randpay: لینک یا اړیکه
pt_br: rand1…, link randpay: ou contato
ru: rand1…, ссылка randpay: или контакт
ta: rand1…, randpay: இணைப்பு அல்லது தொடர்பு
ur: rand1…، randpay: لنک یا رابطہ
zh_hans: rand1…、randpay: 链接或联系人
zh_hant_hk: rand1…、randpay: 連結或聯絡人

source: rpc error
ar: خطأ في RPC
de: RPC-Fehler
es: error de rpc
fa: خطای RPC
fr: erreur RPC
hi: rpc त्रुटि
id: kesalahan RPC
it: errore RPC
ja: RPC エラー
ko: RPC 오류
ms: ralat rpc
pl: błąd RPC
ps: د rpc تېروتنه
pt_br: erro de rpc
ru: ошибка RPC
ta: rpc பிழை
ur: rpc خرابی
zh_hans: RPC 错误
zh_hant_hk: RPC 錯誤

# shielded address decodes to %@ bytes, expected %@
source: shielded address decodes to %1$@ bytes, expected %2$@
ar: يُفكّ العنوان المحمي إلى %@ بايت، والمتوقع %@
de: abgeschirmte Adresse ergibt %@ Bytes, erwartet %@
es: la dirección blindada se decodifica en %@ bytes, se esperaban %@
fa: آدرس محافظت‌شده به %@ بایت رمزگشایی می‌شود، انتظار می‌رفت %@
fr: l'adresse blindée se décode en %@ octets, %@ attendus
hi: शील्डेड पता डिकोड होकर %@ बाइट बनता है, अपेक्षित %@
id: alamat terlindung didekode menjadi %@ byte, seharusnya %@
it: l'indirizzo schermato si decodifica in %@ byte, attesi %@
ja: シールドアドレスをデコードすると %@ バイトですが、%@ バイトが必要です
ko: 차폐 주소를 디코딩하면 %@바이트입니다. %@바이트여야 합니다
ms: alamat terlindung dinyahkod kepada %@ bait, dijangka %@
pl: osłonięty adres dekoduje się do %@ B, oczekiwano %@ B
ps: خوندي پته %@ بایټه ډیکوډ کېږي، %@ تمه کېده
pt_br: o endereço blindado decodifica para %@ bytes, esperado %@
ru: экранированный адрес декодируется в %@ Б, ожидается %@
ta: பாதுகாக்கப்பட்ட முகவரி %@ பைட்டுகளாக டிகோட் ஆகிறது, எதிர்பார்க்கப்பட்டது %@
ur: شیلڈڈ پتہ ڈی کوڈ ہو کر %@ بائٹس بنتا ہے، %@ متوقع تھے
zh_hans: 屏蔽地址解码后为 %@ 字节，应为 %@
zh_hant_hk: 隱私地址解碼為 %@ 位元組，應為 %@

source: shielded address is not base58
ar: العنوان المحمي ليس بترميز base58
de: abgeschirmte Adresse ist kein Base58
es: la dirección blindada no es base58
fa: آدرس محافظت‌شده base58 نیست
fr: l'adresse blindée n'est pas en base58
hi: शील्डेड पता base58 नहीं है
id: alamat terlindung bukan base58
it: l'indirizzo schermato non è base58
ja: シールドアドレスが base58 ではありません
ko: 차폐 주소가 base58이 아닙니다
ms: alamat terlindung bukan base58
pl: osłonięty adres nie jest w base58
ps: خوندي پته base58 نه ده
pt_br: o endereço blindado não é base58
ru: экранированный адрес не в base58
ta: பாதுகாக்கப்பட்ட முகவரி base58 அல்ல
ur: شیلڈڈ پتہ base58 نہیں ہے
zh_hans: 屏蔽地址不是 base58
zh_hant_hk: 隱私地址不是 base58

source: shielded address must start with rand1
ar: يجب أن يبدأ العنوان المحمي بـ rand1
de: abgeschirmte Adresse muss mit rand1 beginnen
es: la dirección blindada debe empezar con rand1
fa: آدرس محافظت‌شده باید با rand1 شروع شود
fr: l'adresse blindée doit commencer par rand1
hi: शील्डेड पता rand1 से शुरू होना चाहिए
id: alamat terlindung harus diawali rand1
it: l'indirizzo schermato deve iniziare con rand1
ja: シールドアドレスは rand1 で始まる必要があります
ko: 차폐 주소는 rand1로 시작해야 합니다
ms: alamat terlindung mesti bermula dengan rand1
pl: osłonięty adres musi zaczynać się od rand1
ps: خوندي پته باید په rand1 پیل شي
pt_br: o endereço blindado deve começar com rand1
ru: экранированный адрес должен начинаться с rand1
ta: பாதுகாக்கப்பட்ட முகவரி rand1 எனத் தொடங்க வேண்டும்
ur: شیلڈڈ پتہ rand1 سے شروع ہونا چاہیے
zh_hans: 屏蔽地址必须以 rand1 开头
zh_hant_hk: 隱私地址必須以 rand1 開頭

source: spend key must be 64 hex characters
ar: يجب أن يكون مفتاح الإنفاق 64 حرفًا ست عشريًا
de: der Ausgabeschlüssel muss aus 64 Hex-Zeichen bestehen
es: la clave de gasto debe tener 64 caracteres hexadecimales
fa: کلید خرج باید 64 نویسه‌ی هگز باشد
fr: la clé de dépense doit faire 64 caractères hexadécimaux
hi: स्पेंड की 64 हेक्स अक्षरों की होनी चाहिए
id: kunci belanja harus 64 karakter hex
it: la chiave di spesa deve essere di 64 caratteri esadecimali
ja: 支出キーは16進数64文字である必要があります
ko: 지출 키는 16진수 64자여야 합니다
ms: kunci perbelanjaan mestilah 64 aksara heks
pl: klucz wydawania musi mieć 64 znaki szesnastkowe
ps: د لګښت کیلي باید 64 hex توري وي
pt_br: a chave de gasto deve ter 64 caracteres hexadecimais
ru: ключ расходования должен состоять из 64 шестнадцатеричных символов
ta: செலவு விசை 64 hex எழுத்துகளாக இருக்க வேண்டும்
ur: اسپینڈ کی کا 64 ہیکس حروف ہونا ضروری ہے
zh_hans: 花费密钥必须是 64 个十六进制字符
zh_hant_hk: 花費私鑰必須是 64 個十六進位字元

source: spend_key must be 64 hex characters
ar: يجب أن يكون spend_key من 64 حرفًا ست عشريًا
de: spend_key muss 64 Hex-Zeichen lang sein
es: spend_key debe tener 64 caracteres hexadecimales
fa: spend_key باید 64 نویسه‌ی هگز باشد
fr: spend_key doit faire 64 caractères hexadécimaux
hi: spend_key 64 हेक्स अक्षरों की होनी चाहिए
id: spend_key harus 64 karakter hex
it: spend_key deve essere di 64 caratteri esadecimali
ja: spend_key は16進数64文字である必要があります
ko: spend_key는 16진수 64자여야 합니다
ms: spend_key mestilah 64 aksara heks
pl: spend_key musi mieć 64 znaki szesnastkowe
ps: spend_key باید 64 hex توري وي
pt_br: spend_key deve ter 64 caracteres hexadecimais
ru: spend_key должен состоять из 64 шестнадцатеричных символов
ta: spend_key 64 hex எழுத்துகளாக இருக்க வேண்டும்
ur: spend_key کا 64 ہیکس حروف ہونا ضروری ہے
zh_hans: spend_key 必须是 64 个十六进制字符
zh_hant_hk: spend_key 必須是 64 個十六進位字元

# the RAND notes hold %@, but the fee is %@
source: the RAND notes hold %1$@, but the fee is %2$@
ar: سندات RAND تحمل %@، لكن الرسوم %@
de: die RAND-Noten halten %@, aber die Gebühr ist %@
es: las notas de RAND contienen %@, pero la comisión es de %@
fa: نوت‌های RAND %@ دارند، اما کارمزد %@ است
fr: les notes RAND contiennent %@, mais les frais sont de %@
hi: RAND नोट में %@ है, लेकिन शुल्क %@ है
id: catatan RAND berisi %@, tetapi biayanya %@
it: le note RAND contengono %@, ma la commissione è di %@
ja: RAND ノートは %@ ですが、手数料は %@ です
ko: RAND 노트에는 %@이(가) 있지만, 수수료는 %@입니다
ms: nota RAND memegang %@, tetapi yuran ialah %@
pl: noty RAND zawierają %@, a opłata to %@
ps: د RAND نوټونه %@ لري، خو فیس %@ دی
pt_br: as notas de RAND somam %@, mas a taxa é %@
ru: в нотах RAND %@, а комиссия составляет %@
ta: RAND நோட்டுகளில் %@ உள்ளது, ஆனால் கட்டணம் %@
ur: RAND نوٹوں میں %@ ہے، لیکن فیس %@ ہے
zh_hans: RAND 票据共有 %@，但手续费为 %@
zh_hant_hk: RAND 票據持有 %@，但手續費為 %@

source: the RandProtocol provers (%@ run by the validators; each one that proves a send sees that wallet's viewing key)
ar: مُثبِتات RandProtocol (%@ يشغّلها المدقّقون، وكل مُثبِت يُثبت إرسالًا يرى مفتاح العرض لتلك المحفظة)
de: der RandProtocol-Prover (%@, betrieben von den Validatoren; jeder, der eine Überweisung beweist, sieht den Ansichtsschlüssel dieser Wallet)
es: los probadores de RandProtocol (%@ administradas por los validadores; cada uno que prueba un envío ve la clave de visualización de esa billetera)
fa: اثبات‌گرهای RandProtocol (%@ که اعتبارسنج‌ها اداره می‌کنند؛ هر اثبات‌گری که یک ارسال را اثبات کند کلید مشاهده‌ی آن کیف پول را می‌بیند)
fr: les prouveurs RandProtocol (%@ aux mains des validateurs ; chacune de celles qui prouvent un envoi voit la clé de visualisation de ce portefeuille)
hi: RandProtocol प्रूवर (वैलिडेटरों द्वारा चलाई गई %@; भेजने का प्रूफ़ बनाने वाला हर प्रूवर उस वॉलेट की व्यूइंग की देखता है)
id: prover RandProtocol (%@ yang dijalankan oleh validator; setiap prover yang membuktikan pengiriman melihat kunci tampilan dompet itu)
it: i prover di RandProtocol (%@ dei validatori; ognuna che genera la prova di un invio vede la chiave di visualizzazione di quel portafoglio)
ja: RandProtocol のプルーバー（バリデーターが運用する %@。送信を証明する各プルーバーはそのウォレットの閲覧キーを見ます）
ko: RandProtocol 프루버(검증자가 운영하는 %@, 전송을 증명하는 프루버는 각각 해당 지갑의 조회 키를 봄)
ms: pembukti RandProtocol (%@ yang dijalankan oleh pengesah; setiap pembukti yang membuktikan penghantaran melihat kunci tontonan dompet itu)
pl: proverów RandProtocol (%@ walidatorów; każdy, który generuje dowód wysyłki, widzi klucz podglądu tego portfela)
ps: RandProtocol ثبوت جوړوونکو (%@ چې تصدیقوونکي یې چلوي؛ هر یو چې یو لېږد ثبوت کړي، د هغه والټ د لیدو کیلي ویني)
pt_br: provadores da RandProtocol (%@ operadas pelos validadores; cada um que prova um envio vê a chave de visualização dessa carteira)
ru: пруверов RandProtocol (%@ под управлением валидаторов; каждый, кто строит доказательство для отправки, видит ключ просмотра этого кошелька)
ta: RandProtocol நிரூபிப்பான்கள் (சரிபார்ப்பாளர்கள் இயக்கும் %@; ஓர் அனுப்புதலை நிரூபிக்கும் ஒவ்வொன்றும் அந்த வாலட்டின் பார்வை விசையைப் பார்க்கும்)
ur: RandProtocol کے پروور (ویلیڈیٹرز کی چلائی ہوئی %@؛ جو بھی کسی ترسیل کا پروف بناتا ہے وہ اس والیٹ کی ویوئنگ کی دیکھتا ہے)
zh_hans: RandProtocol 证明器（由验证者运行的 %@；为一次发送生成证明的那台会看到该钱包的查看密钥）
zh_hant_hk: RandProtocol 證明器（由驗證者運行的 %@；為一次傳送生成證明的那部會看到該錢包的檢視密鑰）

source: the chosen RAND notes do not cover the fee
ar: سندات RAND المختارة لا تغطي الرسوم
de: die gewählten RAND-Noten decken die Gebühr nicht
es: las notas de RAND elegidas no cubren la comisión
fa: نوت‌های RAND انتخاب‌شده کارمزد را پوشش نمی‌دهند
fr: les notes RAND choisies ne couvrent pas les frais
hi: चुने गए RAND नोट शुल्क के लिए पर्याप्त नहीं हैं
id: catatan RAND yang dipilih tidak mencukupi biaya
it: le note RAND scelte non coprono la commissione
ja: 選択した RAND ノートでは手数料をまかなえません
ko: 선택한 RAND 노트로는 수수료를 충당할 수 없습니다
ms: nota RAND yang dipilih tidak menampung yuran
pl: wybrane noty RAND nie pokrywają opłaty
ps: غوره شوي RAND نوټونه فیس نه پوښي
pt_br: as notas de RAND escolhidas não cobrem a taxa
ru: выбранные ноты RAND не покрывают комиссию
ta: தேர்ந்தெடுத்த RAND நோட்டுகள் கட்டணத்தை ஈடுகட்டவில்லை
ur: منتخب کردہ RAND نوٹ فیس پوری نہیں کرتے
zh_hans: 所选的 RAND 票据不足以支付手续费
zh_hant_hk: 所選的 RAND 票據不足以支付手續費

source: the chosen notes do not cover the amount and the burn
ar: السندات المختارة لا تغطي المبلغ والحرق
de: die gewählten Noten decken den Betrag und den Burn nicht
es: las notas elegidas no cubren el monto y la quema
fa: نوت‌های انتخاب‌شده مبلغ و سوزاندن را پوشش نمی‌دهند
fr: les notes choisies ne couvrent pas le montant et le brûlage
hi: चुने गए नोट राशि और बर्न के लिए पर्याप्त नहीं हैं
id: catatan yang dipilih tidak mencukupi jumlah dan burn
it: le note scelte non coprono l'importo e il burn
ja: 選択したノートでは金額とバーン分をまかなえません
ko: 선택한 노트로는 금액과 소각분을 충당할 수 없습니다
ms: nota yang dipilih tidak menampung amaun dan pembakaran
pl: wybrane noty nie pokrywają kwoty i spalenia
ps: غوره شوي نوټونه اندازه او سوځول نه پوښي
pt_br: as notas escolhidas não cobrem o valor e a queima
ru: выбранные ноты не покрывают сумму и сжигание
ta: தேர்ந்தெடுத்த நோட்டுகள் தொகையையும் எரிப்பையும் ஈடுகட்டவில்லை
ur: منتخب کردہ نوٹ رقم اور burn پوری نہیں کرتے
zh_hans: 所选的票据不足以支付金额和销毁量
zh_hant_hk: 所選的票據不足以支付金額和銷毀量

source: the core did not name the payment's transaction key
ar: لم تُسمِّ النواة مفتاح معاملة الدفعة
de: der Core hat den Transaktionsschlüssel der Zahlung nicht genannt
es: el núcleo no indicó la clave de transacción del pago
fa: هسته کلید تراکنش پرداخت را مشخص نکرد
fr: le cœur n'a pas indiqué la clé de transaction du paiement
hi: कोर ने भुगतान की लेन-देन की नहीं बताई
id: core tidak menyebutkan kunci transaksi pembayaran
it: il core non ha indicato la chiave di transazione del pagamento
ja: コアが支払いのトランザクションキーを示しませんでした
ko: 코어가 결제의 거래 키를 알려 주지 않았습니다
ms: teras tidak menamakan kunci transaksi pembayaran
pl: rdzeń nie podał klucza transakcji płatności
ps: هستې د تادیې د راکړې ورکړې کیلي ونه نوموله
pt_br: o núcleo não informou a chave da transação do pagamento
ru: ядро не назвало ключ транзакции платежа
ta: core கட்டணத்தின் பரிவர்த்தனை விசையைக் குறிப்பிடவில்லை
ur: کور نے ادائیگی کی لین دین کی کی نہیں بتائی
zh_hans: 核心没有给出这笔付款的交易密钥
zh_hant_hk: 核心沒有提供這筆付款的交易密鑰

source: the link has no ?url=…&token=… part
ar: الرابط لا يحتوي على الجزء ?url=…&token=…
de: der Link hat keinen ?url=…&token=…-Teil
es: el enlace no tiene la parte ?url=…&token=…
fa: لینک بخش ?url=…&token=… ندارد
fr: le lien n'a pas de partie ?url=…&token=…
hi: लिंक में ?url=…&token=… भाग नहीं है
id: tautan tidak memiliki bagian ?url=…&token=…
it: il link non ha la parte ?url=…&token=…
ja: リンクに ?url=…&token=… の部分がありません
ko: 링크에 ?url=…&token=… 부분이 없습니다
ms: pautan tiada bahagian ?url=…&token=…
pl: link nie ma części ?url=…&token=…
ps: لینک د ?url=…&token=… برخه نه لري
pt_br: o link não tem a parte ?url=…&token=…
ru: в ссылке нет части ?url=…&token=…
ta: இணைப்பில் ?url=…&token=… பகுதி இல்லை
ur: لنک میں ?url=…&token=… والا حصہ نہیں ہے
zh_hans: 链接缺少 ?url=…&token=… 部分
zh_hant_hk: 連結沒有 ?url=…&token=… 部分

source: the link has no token
ar: الرابط لا يحتوي على token
de: der Link hat kein Token
es: el enlace no tiene token
fa: لینک توکن ندارد
fr: le lien n'a pas de jeton
hi: लिंक में टोकन नहीं है
id: tautan tidak memiliki token
it: il link non ha un token
ja: リンクにトークンがありません
ko: 링크에 토큰이 없습니다
ms: pautan tiada token
pl: link nie ma tokena
ps: لینک token نه لري
pt_br: o link não tem token
ru: в ссылке нет токена
ta: இணைப்பில் token இல்லை
ur: لنک میں token نہیں ہے
zh_hans: 链接缺少 token
zh_hant_hk: 連結沒有 token

source: the link has no url
ar: الرابط لا يحتوي على url
de: der Link hat keine URL
es: el enlace no tiene url
fa: لینک url ندارد
fr: le lien n'a pas d'url
hi: लिंक में url नहीं है
id: tautan tidak memiliki url
it: il link non ha un url
ja: リンクに url がありません
ko: 링크에 url이 없습니다
ms: pautan tiada url
pl: link nie ma url
ps: لینک url نه لري
pt_br: o link não tem url
ru: в ссылке нет url
ta: இணைப்பில் url இல்லை
ur: لنک میں url نہیں ہے
zh_hans: 链接缺少 url
zh_hant_hk: 連結沒有 url

source: the link's url is empty
ar: قيمة url في الرابط فارغة
de: die URL des Links ist leer
es: la url del enlace está vacía
fa: url لینک خالی است
fr: l'url du lien est vide
hi: लिंक का url खाली है
id: url tautan kosong
it: l'url del link è vuoto
ja: リンクの url が空です
ko: 링크의 url이 비어 있습니다
ms: url pautan kosong
pl: url w linku jest pusty
ps: د لینک url تش دی
pt_br: a url do link está vazia
ru: url в ссылке пуст
ta: இணைப்பின் url வெறுமையாக உள்ளது
ur: لنک کا url خالی ہے
zh_hans: 链接的 url 为空
zh_hant_hk: 連結的 url 是空的

source: the node served code (%1$@ words) and a public input (%2$@ words) that do not hash to program %3$@; not proving against them
ar: قدّمت العقدة شيفرة (%@ كلمة) ومدخلًا عامًا (%@ كلمة) لا تُعطي تجزئتهما البرنامج %@، لذا لن يُثبَت مقابلهما
de: der Knoten lieferte Code (%@ Wörter) und eine öffentliche Eingabe (%@ Wörter), deren Hash nicht Programm %@ ergibt; es wird nicht dagegen bewiesen
es: el nodo entregó código (%@ palabras) y una entrada pública (%@ palabras) cuyo hash no da el programa %@; no se genera la prueba con ellos
fa: گره کدی (%@ واژه) و ورودی عمومی‌ای (%@ واژه) ارائه داد که هش آن‌ها برنامه‌ی %@ نمی‌شود؛ اثبات بر اساس آن‌ها انجام نمی‌شود
fr: le nœud a fourni du code (%@ mots) et une entrée publique (%@ mots) dont le hash ne donne pas le programme %@ ; aucune preuve n'est générée avec eux
hi: नोड ने कोड (%@ शब्द) और एक पब्लिक इनपुट (%@ शब्द) दिया जिनका हैश प्रोग्राम %@ से मेल नहीं खाता; उनके आधार पर प्रूफ़ नहीं बनाया जा रहा
id: node menyajikan kode (%@ word) dan input publik (%@ word) yang hash-nya bukan program %@; tidak membuktikan dengan keduanya
it: il nodo ha fornito un codice (%@ parole) e un input pubblico (%@ parole) il cui hash non dà il programma %@; nessuna prova su di essi
ja: ノードが提供したコード（%@ ワード）と公開入力（%@ ワード）のハッシュがプログラム %@ と一致しません。これらに対しては証明しません
ko: 노드가 제공한 코드(%@워드)와 공개 입력(%@워드)의 해시가 프로그램 %@과(와) 일치하지 않아 이를 기준으로 증명하지 않습니다
ms: nod memberikan kod (%@ perkataan) dan input awam (%@ perkataan) yang tidak dicincang kepada program %@; tidak membuktikan berdasarkannya
pl: węzeł podał kod (%@ słów) i wejście publiczne (%@ słów), których hash nie daje programu %@; dowód nie zostanie na nich oparty
ps: نوډ کوډ (%@ کلمې) او عامه ننوت (%@ کلمې) وړاندې کړل چې پروګرام %@ ته هش نه کېږي؛ د هغوی پر وړاندې ثبوت نه جوړېږي
pt_br: o nó forneceu código (%@ palavras) e uma entrada pública (%@ palavras) cujo hash não é o programa %@; nada será provado com eles
ru: узел отдал код (%@ слов) и публичный вход (%@ слов), хеш которых не совпадает с программой %@; доказательство по ним не строится
ta: நோட் வழங்கிய code (%@ words) மற்றும் public input (%@ words) புரோகிராம் %@-க்கு hash ஆகவில்லை; அவற்றுக்கு எதிராக நிரூபிக்கப்படவில்லை
ur: نوڈ نے ایسا کوڈ (%@ words) اور ایک public input (%@ words) دیا جو ہیش ہو کر پروگرام %@ نہیں بنتے؛ ان کے خلاف پروف نہیں بنایا جا رہا
zh_hans: 节点提供的代码（%@ 个字）和公开输入（%@ 个字）的哈希与程序 %@ 不符；不基于它们生成证明
zh_hant_hk: 節點提供的程式碼（%@ 個字）和公開輸入（%@ 個字）的雜湊不是程式 %@；不會以它們生成證明

source: the program does not accept this transition: %@
ar: البرنامج لا يقبل هذا الانتقال: %@
de: das Programm akzeptiert diesen Übergang nicht: %@
es: el programa no acepta esta transición: %@
fa: برنامه این گذار را نمی‌پذیرد: %@
fr: le programme n'accepte pas cette transition : %@
hi: प्रोग्राम यह ट्रांज़िशन स्वीकार नहीं करता: %@
id: program tidak menerima transisi ini: %@
it: il programma non accetta questa transizione: %@
ja: プログラムがこの遷移を受け付けません: %@
ko: 프로그램이 이 전이를 받아들이지 않습니다: %@
ms: program tidak menerima peralihan ini: %@
pl: program nie akceptuje tego przejścia: %@
ps: پروګرام دا بدلون نه مني: %@
pt_br: o programa não aceita esta transição: %@
ru: программа не принимает этот переход: %@
ta: புரோகிராம் இந்த மாற்றத்தை ஏற்கவில்லை: %@
ur: پروگرام یہ منتقلی قبول نہیں کرتا: %@
zh_hans: 程序不接受此状态转换：%@
zh_hant_hk: 程式不接受此轉換：%@

source: the proof does not verify: %@
ar: لا يجتاز الإثبات التحقق: %@
de: der Beweis ist nicht gültig: %@
es: la prueba no se verifica: %@
fa: اثبات تأیید نمی‌شود: %@
fr: la preuve ne se vérifie pas : %@
hi: प्रूफ़ सत्यापित नहीं होता: %@
id: bukti tidak terverifikasi: %@
it: la prova non si verifica: %@
ja: 証明が検証できません: %@
ko: 증명이 검증되지 않습니다: %@
ms: bukti tidak dapat disahkan: %@
pl: dowód nie przechodzi weryfikacji: %@
ps: ثبوت تایید نه شو: %@
pt_br: a prova não é válida: %@
ru: доказательство не проходит проверку: %@
ta: நிரூபணம் சரிபார்ப்பில் தேறவில்லை: %@
ur: پروف کی توثیق نہیں ہوتی: %@
zh_hans: 证明验证失败：%@
zh_hant_hk: 證明無法通過驗證：%@

source: the prover accepted the job but named no job id
ar: قبِل المُثبِت المهمة لكنه لم يذكر معرّفًا لها
de: der Prover hat den Auftrag angenommen, aber keine Auftrags-ID genannt
es: el probador aceptó el trabajo pero no indicó ningún id de trabajo
fa: اثبات‌گر کار را پذیرفت اما شناسه‌ی کاری اعلام نکرد
fr: le prouveur a accepté la tâche mais n'a indiqué aucun identifiant de tâche
hi: प्रूवर ने जॉब स्वीकार किया लेकिन कोई जॉब id नहीं बताई
id: prover menerima tugas tetapi tidak menyebutkan ID tugas
it: il prover ha accettato il lavoro ma non ha indicato un id di lavoro
ja: プルーバーはジョブを受け付けましたが、ジョブ ID を返しませんでした
ko: 프루버가 작업을 수락했지만 작업 ID를 알려 주지 않았습니다
ms: pembukti menerima kerja tetapi tidak menamakan id kerja
pl: prover przyjął zadanie, ale nie podał jego identyfikatora
ps: ثبوت جوړوونکي دنده ومنله خو د دندې id یې ونه نوماوه
pt_br: o provador aceitou o trabalho, mas não informou um id de trabalho
ru: прувер принял задание, но не назвал его ID
ta: நிரூபிப்பான் வேலையை ஏற்றது, ஆனால் வேலை id எதையும் குறிப்பிடவில்லை
ur: پروور نے کام قبول کر لیا لیکن کوئی job id نہیں بتائی
zh_hans: 证明器接受了任务，但未给出任务 ID
zh_hant_hk: 證明器接受了工作，但沒有提供工作 ID
